app/controllers/artists_controller.rb

SELECT  "artists".* FROM "artists" LIMIT 200
---
  def index
    if params[:artist_id]
      @posts = Artist.find(params[:artist_id])
    else
      @artists = Artist.all.limit(200)