app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 5]]
SELECT "songs".* FROM "songs"
SELECT COUNT(*) FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 5]]
SELECT  "songs".* FROM "songs" LIMIT 200
---
  def index
    if params[:artist_id]
      @songs = Song.where(artist_id: params[:artist_id])
      if @songs.empty?
        flash[:alert] = "Artist not found."
        @songs = Song.all.limit(200)

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? AND "songs"."artist_id" = ? LIMIT 1  [["id", 7], ["artist_id", 5]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
---
  def show
    if params[:artist_id]
      @song = Song.find_by(id: params[:id], artist_id: params[:artist_id])

      unless @song
        flash[:alert] = "Song not found."
        redirect_to artist_songs_path(Artist.find(params[:artist_id]))